app/controllers/api/v1/paths_controller.rb

INSERT INTO `paths` (`source`, `destination`, `distance`, `created_at`, `updated_at`) VALUES ('S', 'V', 40, '2018-04-10 18:07:55', '2018-04-10 18:07:55')
---
      def index
        path = Path.new
        render json: path.create_update(params)